@extends('user.layout')

@section('desc')
    أنشئ رمز الاستجابة السريعة لأي رابط بسرعة وسهولة، أدخل الرابط واحصل على رمز الاستجابة السريعة في ثوانٍ.
@endsection
@section('key')
    انشاء رمز استجابة سريع, رمز استجابة مجانى, اختصار الرابط, اختصار الروابط
@endsection

@section('title')
    اصنع رمز الاستجابة السريعة
@endsection

@section('body')
    {{-- Header --}}
    <header class="qrHeader mb-5">
        <img src="{{ asset('images/Qr-qr2.png') }}" class="img-fluid" alt="Qr">
    </header>

    {{-- Generate Qr --}}
    <div class="mb-5 p-3">
        <div class="shadow p-3" style="background-color: white;">
            @if (Auth::user())
                @if ($count >= Auth::user()->limitQr)
                    <h3>قد وصلت إلى الحد الأقصى لرموز الاستجابة السريعة QR.</h3>
                @else
                    <h2 class="mb-3 fw-bold text-center mb-5">اصنع رمز الاستجابة السريعة</h2>
                    <div class="row justify-content-center align-items-center mt-5">
                        <div class="col">
                            <form action="{{ route('generateQr') }}" method="POST">
                                @csrf
                                <input type="url" name="url" class="form-control" placeholder="ادخل الرابط" required>
                                @error('url')
                                    <p>{{ $message }}</p>
                                @enderror
                                <button type="submit" class="btn btn-primary btn-block mt-3">احصل على الرابط</button>
                            </form>
                        </div>
                        <div class="col text-center border-start">
                            <img src="{{ asset('images/Qr-qrr.png') }}" class="img-fluid" width="300px" height="300px"
                                alt="Qr">
                        </div>
                    </div>
                @endif
            @else
                <div class="text-center">
                    <h3>قم بتسجيل الدخول لكى تستخدم رمز الاستجابة السريعة Qr</h3>
                    <a href="{{ route('login') }}">تسجيل دخول</a>
                </div>
            @endif
        </div>
    </div>

    {{-- About Qr --}}
    <div class="mb-5 p-3">
        <div class="shadow bg-light p-2">
            <h2 class="text-center mb-3">تعريف رمز الاستجابة السريع QR</h2>
            <div>
                <h4>ماهو رمز الاستجابة السريع Qr ؟</h4>
                <p>
                    يرمز رمز الاستجابة السريعة إلى رمز الاستجابة السريعة وهو يشبه الرمز الشريطي الذي اخترعته شركة Denso Wave
                    في عام 1994. رمز الاستجابة السريعة. فهو يحتوي على معلومات يمكن قراءتها بواسطة الماسح الضوئي لرمز QR،
                    والذي يكون في أغلب الأحيان تطبيقًا للهواتف الذكية. بشكل عام، سيؤدي مسح الرمز الشريطي إلى إرسال المستخدم
                    إلى عنوان URL محدد تم تحديده بواسطة صانع رمز الاستجابة السريعة. ويمكن استخدامها أيضًا لتتبع المخزون
                    ومعرفات المنتجات والمستندات.
                </p>
            </div>
            <div>
                <h4>ما هي فوائد استخدام رموز الروابط السريعة QR؟</h4>
                <p>
                    توفر رموز QR العديد من الفوائد للشركات والأفراد والمؤسسات. يمكن استخدام رموز QR للوصول بسرعة وسهولة إلى
                    المعلومات من خلال مسح بسيط من جهاز محمول مثل تفاصيل الاتصال وأوصاف المنتج وروابط الويب وخيارات الدفع.
                    إنها طريقة سهلة ومريحة لتخزين البيانات دون أن تشغل مساحة كبيرة أو تتطلب أجهزة معقدة. بالإضافة إلى ذلك،
                    بالمقارنة مع الرموز الشريطية التقليدية، تقوم رموز QR بتخزين كميات أكبر من البيانات بطريقة أكثر أمانًا
                    مما يجعلها مثالية للاستخدام في تتبع المنتجات أو الخدمات، والترويج للمنتجات أو الأحداث، وتوفير الوصول
                    الآمن إلى الخدمات أو مواقع الويب.
                </p>
            </div>
            <div>
                <h4>هل أحتاج إلى تطبيق لقراءة رموز الاستجابة السريعة QR؟</h4>
                <p>
                    لا، تتيح لك معظم تطبيقات الكاميرا الافتراضية للهواتف الذكية الجديدة قراءة رمز الاستجابة السريعة. فقط
                    افتح الكاميرا وقم بالمسح الضوئي. بهذه البساطة!
                </p>
            </div>
            <div>
                <h4>ماذا يمكنني أن أفعل إذا كان رمز الاستجابة السريعة Qr الخاص بي لا يعمل؟</h4>
                <p>
                    إذا كان رمز الاستجابة السريعة الخاص بك لا يعمل بشكل صحيح، فهناك العديد من الخطوات الممكنة التي يمكنك
                    اتخاذها لاستكشاف المشكلة وإصلاحها. أولاً، تأكد من صحة الرابط الموجود في رمز الاستجابة السريعة وتشغيله.
                    بعد ذلك، تأكد من أن جهازك المحمول يحتوي على كاميرا تعمل بشكل صحيح وأنه قادر على قراءة الرمز بشكل صحيح.
                    وأخيرًا، إذا استمرت المشكلة، فقد تحتاج إلى تجربة تطبيق قارئ QR مختلف أو حتى إنشاء رمز جديد تمامًا.
                </p>
            </div>
        </div>
    </div>
@endsection
